app/controllers/events_controller.rb

  def create
    @event = Event.new(event_params)

    if @event.save
---
INSERT INTO "events" ("title", "description", "date", "starting_hour", "finished_hour", "photo", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"

  def update
    if @event.update(event_params)
---
UPDATE "events" SET "description" = $1, "starting_hour" = $2, "updated_at" = $3 WHERE "events"."id" = $4  [["description", "hola uwu"], ["starting_hour", "19:00"], ["updated_at", "2022-10-24 22:43:57.162753"], ["id", 3]]